app/controllers/api/followers_controller.rb

SELECT "follows".* FROM "follows" WHERE "follows"."followed_id" = ?  [["followed_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    def all_followers
        @follows = Follow.where(followed_id: params[:id])
        @followers = []
        @follows.each do |f|
            @followers << User.find(f.follower_id)

INSERT INTO "follows" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2015-12-15 14:29:22.510007"], ["updated_at", "2015-12-15 14:29:22.510007"]]
---
    def follow
        if Follow.create(user_params)

DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followed_id" = ?  [["follower_id", 1], ["followed_id", 2]]
---
    def unfollow
        Follow.where(follower_id: params[:id], followed_id: params[:followed]).destroy_all