app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]
---
    def all_posts
        @posts = Post.where(user_id: params[:id])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ?  [["user_id", 2], ["id", 1]]
---
      def remove_post
            Post.where(user_id: params[:id], id: params[:text]).destroy_all

INSERT INTO "posts" ("body", "created_at", "updated_at") VALUES (?, ?, ?)  [["body", "\"ay 7aga\""], ["created_at", "2015-12-15 15:07:11.823760"], ["updated_at", "2015-12-15 15:07:11.823760"]]
---
        def create_post

        if Post.create(post_params)