app/controllers/api/posts_controller.rb

        def all_posts
            @posts = Post.all
---
SELECT "posts".* FROM "posts"

      def remove
            Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]